# Extrusion Analyzer Create Method

Source: https://www.revitapidocs.com/2026/60f25f96-c3f8-8191-a0a9-d298fe5cd10f.htm

---

| Extrusion Analyzer Create Method |
| --- |

Creates an ExtrusionAnalyzer and computes and stores the Solid's shadow.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ExtrusionAnalyzer Create(
	Solid solidGeometry,
	Plane plane,
	XYZ direction
)
```

```
Public Shared Function Create (
	solidGeometry As Solid,
	plane As Plane,
	direction As XYZ
) As ExtrusionAnalyzer
```

```
public:
static ExtrusionAnalyzer^ Create(
	Solid^ solidGeometry,
	Plane^ plane,
	XYZ^ direction
)
```

```
static member Create :
        solidGeometry : Solid *
        plane : Plane *
        direction : XYZ -> ExtrusionAnalyzer
```

#### Parameters

solidGeometry Solid
:   The Solid to analyze.

plane Plane
:   The plane to use for the base plane for the extrusion.

direction XYZ
:   The direction to use for the calculation for the extrusion.
 The direction must be transverse to the base plane.

#### Return Value

ExtrusionAnalyzer
The newly created ExtrusionAnalyzer object. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The input direction must be transverse to the input plane. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | A failure occurred in creating the ExtrusionAnalyzer or computing the Solid's shadow. |

See Also

#### Reference

ExtrusionAnalyzer Class Autodesk.Revit.DB Namespace